<?php

class SiteController extends \BaseController {

	//------------------------------------------------------------------------------
	// Показывает главную страницу сайта
	//------------------------------------------------------------------------------
	public function getShowIndex() {

		$view = View::make('site.home');

		return $view;
	}


	//------------------------------------------------------------------------------
	// Показывает подкатегорию
	//------------------------------------------------------------------------------
	public function getShowCategory($category) {
		return 'category';
	}


	//------------------------------------------------------------------------------
	// Показывает покатегорию
	//------------------------------------------------------------------------------
	public function getShowSubcategory($category, $subcategory) {
		return 'subcategory';
	}


	//------------------------------------------------------------------------------
	// Показывает статью
	//------------------------------------------------------------------------------
	public function getShowArticle($category, $subcategory, $alias) {
		return 'article';
	}
}